GreatCowBASIC/DATFileGenerator/incfiles/p16F18055.inc
        LIST
;==========================================================================
;
;  Built by Great Cow BASIC convertor
;  MPASM processor include for the chip shown below
;
; C:\Users\admin\.mchp_packs\index.idx
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.15.191\xc8\pic\dat\ini\16F18055.ini
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.15.191\edc\PIC16F18055.PIC
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.15.191\xc8\pic\dat\cfgdata\16F18055.cfgdata
;
;==========================================================================
        NOLIST
        IFNDEF __16F18055
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF
;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------

;-----Bank0------------------
INDF0            EQU  H'0000'
INDF1            EQU  H'0001'
PCL              EQU  H'0002'
STATUS           EQU  H'0003'
FSR0             EQU  H'0004'
FSR0L            EQU  H'0004'
FSR0H            EQU  H'0005'
FSR1             EQU  H'0006'
FSR1L            EQU  H'0006'
FSR1H            EQU  H'0007'
BSR              EQU  H'0008'
WREG             EQU  H'0009'
PCLATH           EQU  H'000A'
INTCON           EQU  H'000B'
PORTA            EQU  H'000C'
PORTB            EQU  H'000D'
PORTC            EQU  H'000E'
PORTE            EQU  H'0010'
TRISA            EQU  H'0012'
TRISB            EQU  H'0013'
TRISC            EQU  H'0014'
TRISE            EQU  H'0016'
LATA             EQU  H'0018'
LATB             EQU  H'0019'
LATC             EQU  H'001A'
LATE             EQU  H'001C'

;-----Bank1------------------
PIR0             EQU  H'008C'
PIR1             EQU  H'008D'
PIR2             EQU  H'008E'
PIR3             EQU  H'008F'
PIR4             EQU  H'0090'
PIE0             EQU  H'0096'
PIE1             EQU  H'0097'
PIE2             EQU  H'0098'
PIE3             EQU  H'0099'
PIE4             EQU  H'009A'

;-----Bank3------------------
WDTCON           EQU  H'018C'
BORCON           EQU  H'018D'
PCON0            EQU  H'018E'
PCON1            EQU  H'018F'
TMR0L            EQU  H'019C'
TMR0             EQU  H'019C'
TMR0H            EQU  H'019D'
PR0              EQU  H'019D'
T0CON0           EQU  H'019E'
T0CON1           EQU  H'019F'

;-----Bank4------------------
OSCCON2          EQU  H'020E'
OSCCON3          EQU  H'020F'
OSCSTAT          EQU  H'0210'
OSCEN            EQU  H'0211'
OSCTUNE          EQU  H'0212'
OSCFRQ           EQU  H'0213'
ACTCON           EQU  H'0214'

;-----Bank5------------------
TMR1             EQU  H'028C'
TMR1L            EQU  H'028C'
TMR1H            EQU  H'028D'
T1CON            EQU  H'028E'
T1GCON           EQU  H'028F'
PR1              EQU  H'028F'
T1GATE           EQU  H'0290'
TMR1GATE         EQU  H'0290'
T1CLK            EQU  H'0291'
TMR1CLK          EQU  H'0291'
TMR3             EQU  H'0292'
TMR3L            EQU  H'0292'
TMR3H            EQU  H'0293'
T3CON            EQU  H'0294'
T3GCON           EQU  H'0295'
PR3              EQU  H'0295'
T3GATE           EQU  H'0296'
TMR3GATE         EQU  H'0296'
T3CLK            EQU  H'0297'
TMR3CLK          EQU  H'0297'

;-----Bank6------------------
T2TMR            EQU  H'030C'
TMR2             EQU  H'030C'
T2PR             EQU  H'030D'
PR2              EQU  H'030D'
T2CON            EQU  H'030E'
T2HLT            EQU  H'030F'
T2CLKCON         EQU  H'0310'
T2CLK            EQU  H'0310'
T2RST            EQU  H'0311'
T4TMR            EQU  H'0312'
TMR4             EQU  H'0312'
T4PR             EQU  H'0313'
PR4              EQU  H'0313'
T4CON            EQU  H'0314'
T4HLT            EQU  H'0315'
T4CLKCON         EQU  H'0316'
T4CLK            EQU  H'0316'
T4RST            EQU  H'0317'
T6TMR            EQU  H'0318'
TMR6             EQU  H'0318'
T6PR             EQU  H'0319'
PR6              EQU  H'0319'
T6CON            EQU  H'031A'
T6HLT            EQU  H'031B'
T6CLKCON         EQU  H'031C'
T6CLK            EQU  H'031C'
T6RST            EQU  H'031D'

;-----Bank7------------------
CCPR1            EQU  H'038C'
CCPR1L           EQU  H'038C'
CCPR1H           EQU  H'038D'
CCP1CON          EQU  H'038E'
CCP1CAP          EQU  H'038F'
CCPR2            EQU  H'0390'
CCPR2L           EQU  H'0390'
CCPR2H           EQU  H'0391'
CCP2CON          EQU  H'0392'
CCP2CAP          EQU  H'0393'
CCPTMRS0         EQU  H'039F'

;-----Bank8------------------
PWM3DC           EQU  H'040C'
PWM3DCL          EQU  H'040C'
PWM3DCH          EQU  H'040D'
PWM3CON          EQU  H'040E'
PWM4DC           EQU  H'040F'
PWM4DCL          EQU  H'040F'
PWM4DCH          EQU  H'0410'
PWM4CON          EQU  H'0411'
PWM5DC           EQU  H'0412'
PWM5DCL          EQU  H'0412'
PWM5DCH          EQU  H'0413'
PWM5CON          EQU  H'0414'
PWMTMRS0         EQU  H'041F'

;-----Bank9------------------
NCO1ACC          EQU  H'048C'
NCO1ACCL         EQU  H'048C'
NCO1ACCH         EQU  H'048D'
NCO1ACCU         EQU  H'048E'
NCO1INC          EQU  H'048F'
NCO1INCL         EQU  H'048F'
NCO1INCH         EQU  H'0490'
NCO1INCU         EQU  H'0491'
NCO1CON          EQU  H'0492'
NCO1CLK          EQU  H'0493'

;-----Bank10------------------
CWG1CLK          EQU  H'050C'
CWG1CLKCON       EQU  H'050C'
CWG1ISM          EQU  H'050D'
CWG1DAT          EQU  H'050D'
CWG1DBR          EQU  H'050E'
CWG1DBF          EQU  H'050F'
CWG1CON0         EQU  H'0510'
CWG1CON1         EQU  H'0511'
CWG1AS0          EQU  H'0512'
CWG1AS1          EQU  H'0513'
CWG1STR          EQU  H'0514'

;-----Bank11------------------
CLCNCON          EQU  H'058C'
CLCNPOL          EQU  H'058D'
CLCNSEL0         EQU  H'058E'
CLCNSEL1         EQU  H'058F'
CLCNSEL2         EQU  H'0590'
CLCNSEL3         EQU  H'0591'
CLCNGLS0         EQU  H'0592'
CLCNGLS1         EQU  H'0593'
CLCNGLS2         EQU  H'0594'
CLCNGLS3         EQU  H'0595'
CLCSELECT        EQU  H'0596'
CLCDATA          EQU  H'0597'

;-----Bank12------------------
RC1REG           EQU  H'060C'
TX1REG           EQU  H'060D'
SP1BRG           EQU  H'060E'
SP1BRGL          EQU  H'060E'
SP1BRGH          EQU  H'060F'
RC1STA           EQU  H'0610'
TX1STA           EQU  H'0611'
BAUD1CON         EQU  H'0612'
RC2REG           EQU  H'0616'
TX2REG           EQU  H'0617'
SP2BRG           EQU  H'0618'
SP2BRGL          EQU  H'0618'
SP2BRGH          EQU  H'0619'
RC2STA           EQU  H'061A'
TX2STA           EQU  H'061B'
BAUD2CON         EQU  H'061C'

;-----Bank13------------------
SSP1BUF          EQU  H'068C'
SSP1ADD          EQU  H'068D'
SSP1MSK          EQU  H'068E'
SSP1STAT         EQU  H'068F'
SSP1CON1         EQU  H'0690'
SSP1CON2         EQU  H'0691'
SSP1CON3         EQU  H'0692'
SSP2BUF          EQU  H'0696'
SSP2ADD          EQU  H'0697'
SSP2MSK          EQU  H'0698'
SSP2STAT         EQU  H'0699'
SSP2CON1         EQU  H'069A'
SSP2CON2         EQU  H'069B'
SSP2CON3         EQU  H'069C'

;-----Bank32------------------
FVRCON           EQU  H'100C'
CPCON            EQU  H'100D'
ZCDCON           EQU  H'101F'

;-----Bank33------------------
CM1CON0          EQU  H'108C'
CM1CON1          EQU  H'108D'
CM1NCH           EQU  H'108E'
CM1PCH           EQU  H'108F'
CMOUT            EQU  H'109F'
CMSTAT           EQU  H'109F'

